class Translation(object):

    START_MSG = """ 
𝙷𝙴𝚈 🙋🏻 {}

𝙸𝙰𝙼 𝙰 𝚂𝙸𝙼𝙿𝙻𝙴 𝙱𝙾𝚃 𝙵𝙾𝚁 𝙵𝙸𝙽𝙳𝙸𝙽𝙶 𝙸𝙳 𝙸𝙽 𝚃𝙴𝙻𝙴𝙶𝚁𝙰𝙼 💛💫

𝙲𝙻𝙸𝙲𝙺 𝚃𝙷𝙴 𝙷𝙴𝙻𝙿 𝙱𝚄𝚃𝚃𝙾𝙽 𝙾𝚁 /help
 𝙵𝙾𝚁 𝙼𝙾𝚁𝙴 𝙸𝙽𝙵𝙾𝚁𝙼𝙰𝚃𝙸𝙾𝙽

⊶≕≍≖⋆≎≢≣⁂≋∺∻⊶≕≍≖⋆≎≢≣⁂≋∺∻

① أرسل /info لإظهار إيديك

② قم بعمل توجيه منشور في قناتك لأظهار إيدي القناة

③ أضفني إلى مجموعتك لإظهار إيدي المجموعة

[𝙽𝙴𝚆 𝚈𝙾𝚁𝙺](https://t.me/us7a5)

"""

    HELP_MSG = """
<u>𝚃𝙷𝙴 𝙵𝙾𝙻𝙻𝙾𝚆𝙸𝙽𝙶 𝙸𝚂 𝚃𝙷𝙴 𝙸𝙳 𝚁𝙴𝚅𝙴𝙰𝙻𝙸𝙽𝙶 𝙼𝙴𝚃𝙷𝙾𝙳</u>

  ✮ 𝙲𝙻𝙸𝙲𝙺 𝚃𝙷𝙴 𝚃𝙴𝙻𝙴𝙶𝚁𝙰𝙼 𝙸𝙳 𝙱𝚄𝚃𝚃𝙾𝙼 𝙾𝚁 /id 𝙱𝙴𝙻𝙾𝚆 𝚃𝙾 𝙿𝙸𝙲𝙺 𝚈𝙾𝚄𝚁 𝚃𝙴𝙻𝙴𝚁𝙰𝙼 𝙸𝙳

  ✮ 𝙲𝙻𝙸𝙲𝙺 𝚃𝙷𝙴 𝚃𝙴𝙻𝙴𝙶𝚁𝙰𝙼 𝙸𝙽𝙵𝙾 𝙱𝚄𝚃𝚃𝙾𝙼 𝙾𝚁 /info 𝙱𝙴𝙻𝙾𝚆 𝚃𝙾 𝙿𝙸𝙲𝙺 𝚈𝙾𝚄𝚁 𝚃𝙴𝙻𝙴𝚁𝙰𝙼 𝙸𝙽𝙵𝙾𝚁𝙼𝙰𝚃𝙸𝙾𝙽 

  ✮ 𝙸𝙵𝚈𝙾𝚄 𝚂𝙴𝙽𝙳 𝙰 𝙼𝙴𝚂𝚂𝙰𝙶𝙴 [𝚄𝚂𝙸𝙽𝙶 𝚃𝙷𝙴 𝙵𝙾𝚁𝚆𝙰𝚁𝙳 𝚃𝙰𝙶] 𝙵𝚁𝙾𝙼 𝚈𝙾𝚄𝚁 [𝙿𝚄𝙱𝙻𝙸𝙲 𝙾𝚁 𝙿𝚁𝙸𝚅𝙰𝚃𝙴] 𝙶𝚁𝙾𝚄𝙿 𝚈𝙾𝚄 𝚆𝙸𝙻𝙻 𝚁𝙴𝙲𝙴𝙸𝚅𝙴 𝚃𝙷𝙴 𝙸𝙳 𝙾𝙵 𝚃𝙷𝙰𝚃 𝙶𝚁𝙾𝚄𝙿
  ✮ 𝙸𝙵𝚈𝙾𝚄 𝚂𝙴𝙽𝙳 𝙰 𝙼𝙴𝚂𝚂𝙰𝙶𝙴 [𝚄𝚂𝙸𝙽𝙶 𝚃𝙷𝙴 𝙵𝙾𝚁𝚆𝙰𝚁𝙳 𝚃𝙰𝙶] 𝙵𝚁𝙾𝙼 𝚈𝙾𝚄𝚁 [𝙿𝚄𝙱𝙻𝙸𝙲 𝙾𝚁 𝙿𝚁𝙸𝚅𝙰𝚃𝙴] 𝙲𝙷𝙰𝙽𝙽𝙴𝙻 𝚈𝙾𝚄 𝚆𝙸𝙻𝙻 𝚁𝙴𝙲𝙴𝙸𝚅𝙴 𝚃𝙷𝙴 𝙸𝙳 𝙾𝙵 𝚃𝙷𝙰𝚃 𝙲𝙷𝙰𝙽𝙽𝙴𝙻

  ✮ 𝙸𝙵 𝚈𝙾𝚄 𝙽𝙴𝙴𝙳 𝚃𝙷𝙴 𝙸𝙳 𝙾𝙵 𝙰𝙽𝚈 𝙱𝙾𝚃, 𝚂𝙴𝙽𝙳 𝙱𝙾𝚃 𝙼𝙴𝚂𝚂𝙰𝙶𝙴 𝙷𝙴𝚁𝙴 𝙵𝚁𝙾𝙼 𝚃𝙷𝚃 𝙱𝙾𝚃 [𝚆𝙸𝚃𝙷 𝙵𝙾𝚁𝚆𝙰𝚁𝙳 𝚃𝙰𝙶]

  ✮ 𝙸𝙵 𝚈𝙾𝚄 𝙽𝙴𝙴𝙳 𝙰 𝚃𝙴𝙻𝙴𝙶𝚁𝙰𝙼 𝚄𝙰𝙴𝚁 𝙸𝙳, 𝙵𝙾𝚁𝚆𝙰𝚁𝙳 𝙰 𝙼𝙴𝚂𝚂𝙰𝙶𝙴 𝚃𝙾 𝚃𝙷𝙴𝙼 𝙷𝙴𝚁𝙴 [𝚆𝙸𝚃𝙷 𝙵𝙾𝚁𝚆𝙰𝚁𝙳 𝚃𝙰𝙶]

  ✮  𝙸𝙵 𝚈𝙾𝚄 𝙶𝙸𝚅𝙴 𝚈𝙾𝚄𝚁 𝚁𝙴𝙿𝙻𝚈 /Json 𝙰𝙽𝚈 [𝙼𝙴𝚂𝚂𝙰𝙶𝙴, 𝙵𝙸𝙻𝙴𝚂, 𝙼𝙴𝙳𝙸𝙰, 𝚂𝚃𝙸𝙲𝙺𝙴𝚁𝚂] 𝚈𝙾𝚄 𝚆𝐢𝙸𝙻𝙻 𝙶𝙴𝚃 𝚃𝙷𝙴 𝙹𝚂𝙾𝙽 𝙵𝙸𝙻𝙴𝚂 𝙾𝙵 𝚃𝙷𝙾𝚂𝙴 𝙵𝙸𝙻𝙴𝚂
  
  ✮ 𝙸𝙵 𝚈𝙾𝚄 𝙽𝙴𝙴𝙳 𝚃𝙾 𝙶𝙴𝚃 𝙰𝙽 𝙸'𝙳 𝙾𝙵 𝙰 𝚂𝚃𝙸𝙲𝙺𝙴𝚁 𝙿𝙰𝙲𝙺 𝙹𝚄𝚂𝚃 𝚂𝙴𝙽𝙳 𝚃𝙷𝙴 𝚂𝚃𝙴 𝚂𝚃𝙸𝙲𝙺𝙴𝚁 𝙰𝙽𝙳 𝚁𝙴𝙿𝙻𝚈 𝙸𝚃 𝚆𝙸𝚃𝙷 /stickerid 𝙲𝙾𝙼𝙼𝙰𝙽𝙳 𝚈𝙾𝚄 𝚆𝙾𝚄𝙸𝙳 𝙶𝙴𝚃 𝙸𝚃𝚂 𝙸𝙳.
"""

    ABOUT_MSG = """
<u>🤖 𝙼𝚈 𝙽𝙰𝙼𝙴</u> ➻ <a href='https://t.me/{}'>★ بو̲نٰــۦٕ٘ـ. ايـۘـِۘ◌ـِۘـۘدي ★</a> 
  
<u>📝 𝙻𝙰𝙽𝙶𝚄𝙰𝙶𝙴</u> ➻ <a href='https://www.python.org/'>𝙿𝚈𝚃𝙷𝙾𝙽③</a>

<u>🧰 𝙵𝚁𝙰𝙼𝙴𝚆𝙾𝚁𝙺</u> ➻ <a href='https://github.com/pyrogram/pyrogram'>𝙿𝚈𝚁𝙾𝙶𝚁𝙰𝙼</a>
 
<u>📢 𝙲𝙷𝙰𝙽𝙽𝙴𝙻</u> ➻ <a href='t.me/{}'>𝙽𝙴𝚆 𝚈𝙾𝚁𝙺</a>

<u>❣️ 𝚈𝙾𝚄𝚃𝚄𝙱𝙴</u> ➻ <a href='https://youtube.com/channel/UCe-gwa48GwgTIE7T5fmpbJw'>𝚈𝙾𝚄𝚃𝚄𝙱𝙴</a>

"""
    JOIN_TEXT = """
𝗡𝗘𝗪 𝗬𝗢𝗥𝗞 ✈
"""
 
    TRY_TEXT = """
💫 𝚁𝙴𝚂𝚃𝙰𝚁𝚃 𝙽𝙾𝚆 💫
"""

    FSUB_TEXT = """
▬▬ι═════════════════ι▬▬ 

★ عذرا عزيزي
★ عليك الاشتراك بقناة البوت لتتمكن من استخدامه

- https://t.me/us7a5

★ اشترك ثم ارسل /start

 ▬▬ι═════════════════ι▬▬

❀•°•═════ஓ๑♡๑ஓ═════•°•❀

★ 𝙹𝙾𝙸𝙽 𝙼𝚈 𝚄𝙿𝙳𝙰𝚃𝙴

★ 𝙲𝙷𝙰𝙽𝙽𝙴𝙻 𝚃𝙷𝙴𝙽 𝚄𝚂𝙴 𝚃𝙷𝙸𝚂 𝙱𝙾𝚃

❀•°•═════ஓ๑♡๑ஓ═════•°•❀
"""

    ID_TEXT = """
🖤🥀 𝚈𝙾𝚄𝚁 𝚃𝙴𝙻𝙴𝚁𝙰𝙼 𝙸𝙳 𝙸𝚂 ➻ <code>{}</code>
"""

    INFO_TEXT = """
<u>𝚃𝙴𝙻𝙴𝙶𝙰𝚁𝙼 𝙸𝙽𝙵𝙾𝚁𝙼𝙰𝚃𝙸𝙾𝙽 ♥️🦧</u>

 🦋 𝙵𝙸𝚁𝚂𝚃 𝙽𝙰𝙼𝙴 ➻ <b>{}</b>

 🍓 𝚂𝙴𝙲𝙾𝙽𝙳 𝙽𝙰𝙼𝙴 ➻ <b>{}</b>

 🧚‍♀️ 𝚄𝙰𝙴𝚁 𝙽𝙰𝙼𝙴 ➻ <b>@{}</b>

 🥤𝚃𝙴𝙻𝙴𝙶𝚁𝙰𝙼 𝙸𝙳 ➻ <code>{}</code>

 💚 𝙿𝚁𝙾𝙵𝙸𝙻𝙴 𝙻𝙸𝙽𝙺 ➻ <b>{}</b>

 🌏 𝙳𝙲 ➻ <b>{}</b>

 🏂 𝙻𝙰𝙽𝙶𝚄𝙰𝙶𝙴 ➻ <b>{}</b>

 💝 𝚂𝚃𝙰𝚃𝚄𝚂 ➻ <b>{}</b>
"""
